backend/load-test.yml
config:
  target: "http://localhost:5000"
  phases:
    - duration: 60  # Run test for 60 seconds
      arrivalRate: 5  # 5 requests per second
scenarios:
  - flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "test@example.com"
            password: "password123"
      - get:
          url: "/api/transactions"